[
  {
    "title": "Vue: Motion directive",
    "platform": "vue",
    "id": "motion-directive",
    "description": "Animate UIs in Motion for Vue with motion components. Animate CSS, transforms, & SVGs. Use variants for orchestration, gestures, and keyframes."
  },
  {
    "title": "Vue: Get started with Motion for Vue",
    "platform": "vue",
    "id": "vue",
    "description": "Learn Motion for Vue animation library: Install, animate HTML and SVG elements with spring animations, staggering effects. Complete guide with examples."
  },
  {
    "title": "Vue: Vue animation",
    "platform": "vue",
    "id": "animation",
    "description": "Animate UIs in Motion for Vue with motion components. Animate CSS, transforms, & SVGs. Use variants for orchestration, gestures, and keyframes."
  },
  {
    "title": "Vue: Gesture animation",
    "platform": "vue",
    "id": "gestures",
    "description": "Power your UI with Motion for Vue's gestures: hover, tap, pan, drag & inView. Use while- props for animations & event listeners for interactive experiences."
  },
  {
    "title": "Vue: Layout animation",
    "platform": "vue",
    "id": "layout-animations",
    "description": "Animate layouts effortlessly in Vue with Motion's layout prop. Smoothly transition CSS, even between different elements using layoutId. Performant & flexible."
  },
  {
    "title": "Vue: Scroll animation",
    "platform": "vue",
    "id": "scroll-animations",
    "description": "Create scroll-triggered or scroll-linked animations with Motion for Vue. Use whileInView for viewport triggers and useScroll to link animations to scroll progress."
  },
  {
    "title": "Vue: Transition options",
    "platform": "vue",
    "id": "transitions",
    "description": "Define animation behavior with Motion for Vue's transition prop. Choose time-based or physics-based animations. Customize duration, easing, delay, and repeat."
  },
  {
    "title": "Vue: Motion component",
    "platform": "vue",
    "id": "motion-component",
    "description": "Drive animations in Motion for Vue with motion components. Supercharge HTML/SVG for 120fps animations & gestures. High-performance, SSR-compatible & customizable."
  },
  {
    "title": "Vue: AnimatePresence",
    "platform": "vue",
    "id": "animate-presence",
    "description": "Enable effortless exit animations in Vue with AnimatePresence. It animates components on removal via the exit prop."
  },
  {
    "title": "Vue: LayoutGroup",
    "platform": "vue",
    "id": "layout-group",
    "description": "Coordinate Vue layout animations between related Motion components with LayoutGroup. Group elements to share state and enable seamless transitions, even if not rendered together. Namespace layoutId for complex UIs."
  },
  {
    "title": "Vue: LazyMotion",
    "platform": "vue",
    "id": "lazymotion",
    "description": "Reduce your initial bundle size with LazyMotion in Motion for Vue. Load animation features synchronously or asynchronously, shrinking bundles to as low as 6kb."
  },
  {
    "title": "Vue: MotionConfig",
    "platform": "vue",
    "id": "motion-config",
    "description": "Configure all child motion components in Vue with MotionConfig. Set global transitions, manage reducedMotion preferences, and ensure CSP nonce compliance easily."
  },
  {
    "title": "Vue: Reorder",
    "platform": "vue",
    "id": "reorder",
    "description": "Easily create drag-to-reorder lists with Motion for Vue's Reorder components. Use Reorder.Group and Reorder.Item to manage list order, with automatic layout and exit animations. Lightweight and simple."
  },
  {
    "title": "Vue: Motion values",
    "platform": "vue",
    "id": "motion-value",
    "description": "Power Vue animations with Motion values. Track state/velocity, sync components, & update styles without re-renders. Compose with useTransform/useSpring."
  },
  {
    "title": "Vue: useMotionTemplate",
    "platform": "vue",
    "id": "use-motion-template",
    "description": "Combine motion values into dynamic strings with Motion for Vue's useMotionTemplate. Create auto-updating, interpolated values for responsive animations."
  },
  {
    "title": "Vue: useMotionValueEvent",
    "platform": "vue",
    "id": "use-motion-value-event",
    "description": "Manage motion value event listeners in Vue with useMotionValueEvent. Auto-cleans events like change & animationComplete for dynamic UIs."
  },
  {
    "title": "Vue: useScroll",
    "platform": "vue",
    "id": "use-scroll",
    "description": "Create Vue scroll-linked animations like progress bars & parallax with Motion for Vue's useScroll hook. Track scroll, element position & use motion values."
  },
  {
    "title": "Vue: useSpring",
    "platform": "vue",
    "id": "use-spring",
    "description": "Discover Motion for Vue's useSpring hook. Create smooth spring animations for motion values. Learn to animate with .set(), track values & customize transitions."
  },
  {
    "title": "Vue: useTime",
    "platform": "vue",
    "id": "use-time",
    "description": "Explore Motion for Vue's useTime hook. It returns elapsed time in ms every frame. Learn how it creates perpetual animations & composes with other motion values."
  },
  {
    "title": "Vue: useTransform",
    "platform": "vue",
    "id": "use-transform",
    "description": "Discover Motion for Vue's useTransform hook. Create new motion values by transforming others. Learn to map ranges & use clamp, ease, mixer for advanced control."
  },
  {
    "title": "Vue: useVelocity",
    "platform": "vue",
    "id": "use-velocity",
    "description": "Discover Motion for Vue's useVelocity hook. It tracks a motion value's velocity, letting you monitor the rate of change for any animatable value easily."
  },
  {
    "title": "Vue: useAnimate",
    "platform": "vue",
    "id": "use-animate",
    "description": "Discover Motion for Vue's useAnimate hook for component-scoped animations. Use its animate function for manual control, scoped selectors & auto cleanup."
  },
  {
    "title": "Vue: useAnimationFrame",
    "platform": "vue",
    "id": "use-animation-frame",
    "description": "Use Motion for Vue's useAnimationFrame hook to run callbacks on every frame. Leverage time & delta args for precise animation control & custom frame logic."
  },
  {
    "title": "Vue: useDragControls",
    "platform": "vue",
    "id": "use-drag-controls",
    "description": "Master Motion for Vue's useDragControls hook. Manually start drag gestures, add touch support, snap to cursor & customize drag interactions for your components."
  },
  {
    "title": "Vue: useInView",
    "platform": "vue",
    "id": "use-in-view",
    "description": "Use Motion for Vue's tiny useInView hook (0.6kb) to detect when elements enter the viewport. Track visibility, trigger effects & customize detection easily."
  },
  {
    "title": "Vue: useReducedMotion",
    "platform": "vue",
    "id": "use-reduced-motion",
    "description": "Learn to use Motion for Vue's useReducedMotion hook to detect reduced motion settings. Create accessible UIs by adapting animations and motion features."
  },
  {
    "title": "Vue: Integrate Motion with Radix",
    "platform": "vue",
    "id": "radix",
    "description": "Integrate Motion with Radix Vue for stunning animations. Learn to animate Radix primitives, use AnimatePresence for smooth exits, & animate Tooltip, Toast & more."
  },
  {
    "title": "React: Get started with Motion for React",
    "platform": "react",
    "id": "react",
    "description": "Learn Motion for React animation library: Install, animate HTML and SVG elements with spring animations, staggering effects. Complete guide with examples."
  },
  {
    "title": "React: React animation",
    "platform": "react",
    "id": "animation",
    "description": "Learn how to create React animations with Motion. Animate CSS, transforms, & SVGs. Use variants for orchestration, gestures, and keyframes."
  },
  {
    "title": "React: Layout animation",
    "platform": "react",
    "id": "layout-animations",
    "description": "Animate layout changes in React with Motion. Auto layout transitions, FLIP, shared-element animations via layoutId, and performance tips (with code)."
  },
  {
    "title": "React: Scroll animation",
    "platform": "react",
    "id": "scroll-animations",
    "description": "Create scroll-triggered or scroll-linked animations with Motion for React. Use whileInView for viewport triggers and useScroll to link animations to scroll progress."
  },
  {
    "title": "React: SVG animation",
    "platform": "react",
    "id": "svg-animation",
    "description": "SVG animations in React with Motion. Line drawing via pathLength, transforms, attribute animation (attrX/attrY), scroll-linked animations, morphing and more."
  },
  {
    "title": "React: Transitions",
    "platform": "react",
    "id": "transitions",
    "description": "Define animation behavior with Motion for React's transition prop. Choose time-based or physics-based animations. Customize duration, easing, delay, and repeat."
  },
  {
    "title": "React: Gesture animation",
    "platform": "react",
    "id": "gestures",
    "description": "Power your UI with Motion for React's gestures: hover, tap, pan, drag & inView. Use while- props for animations & event listeners for interactive experiences."
  },
  {
    "title": "React: Hover animation",
    "platform": "react",
    "id": "hover-animation",
    "description": "A complete guide to creating hover animations and effects in React with Motion. Go beyond CSS with the whileHover prop and the hover() function for advanced, cross-platform interactions."
  },
  {
    "title": "React: Drag animation",
    "platform": "react",
    "id": "drag",
    "description": "A complete guide to creating drag animations in React with Motion. Learn to build draggable UIs with constraints, momentum, direction locking, and more."
  },
  {
    "title": "React: Motion component",
    "platform": "react",
    "id": "motion-component",
    "description": "Drive animations in Motion for React with motion components. Supercharge HTML/SVG for 120fps animations & gestures. High-performance, SSR-compatible & customizable."
  },
  {
    "title": "React: AnimatePresence",
    "platform": "react",
    "id": "animate-presence",
    "description": "Enable effortless exit animations in React with AnimatePresence. It animates components on removal via the exit prop."
  },
  {
    "title": "React: LayoutGroup",
    "platform": "react",
    "id": "layout-group",
    "description": "Group elements to share state and enable seamless layout transitions, even when not re-rendered together. Namespace layoutId for complex UIs."
  },
  {
    "title": "React: LazyMotion",
    "platform": "react",
    "id": "lazy-motion",
    "description": "Reduce your initial bundle size with LazyMotion in Motion for React. Load animation features synchronously or asynchronously, shrinking bundles to as low as 4.6kb."
  },
  {
    "title": "React: MotionConfig",
    "platform": "react",
    "id": "motion-config",
    "description": "Configure all child motion components in React with MotionConfig. Set global transitions, manage reducedMotion preferences, and ensure CSP nonce compliance easily."
  },
  {
    "title": "React: Reorder",
    "platform": "react",
    "id": "reorder",
    "description": "Easily create drag-to-reorder lists with Motion for React's Reorder components. Use Reorder.Group and Reorder.Item to manage list order, with automatic layout and exit animations. Lightweight and simple."
  },
  {
    "title": "React: Motion values overview",
    "platform": "react",
    "id": "motion-value",
    "description": "Power React animations with Motion values. Track state/velocity, sync components & update styles without re-renders. Compose with useTransform/useSpring."
  },
  {
    "title": "React: useMotionTemplate",
    "platform": "react",
    "id": "use-motion-template",
    "description": "Combine motion values into dynamic strings with Motion for React's useMotionTemplate. Create auto-updating, interpolated values for responsive animations."
  },
  {
    "title": "React: useMotionValueEvent",
    "platform": "react",
    "id": "use-motion-value-event",
    "description": "Manage motion value event listeners in React with useMotionValueEvent. Auto-cleans events like change & animationComplete for dynamic UIs."
  },
  {
    "title": "React: useScroll",
    "platform": "react",
    "id": "use-scroll",
    "description": "Create scroll-linked animations like progress bars & parallax with Motion for React's useScroll hook. Track scroll, element position & use motion values."
  },
  {
    "title": "React: useSpring",
    "platform": "react",
    "id": "use-spring",
    "description": "Discover Motion for React's useSpring hook. Create smooth spring animations for motion values. Learn to animate with .set(), track values & customize transitions."
  },
  {
    "title": "React: useTime",
    "platform": "react",
    "id": "use-time",
    "description": "Explore Motion for React's useTime hook. It returns elapsed time in ms every frame. Learn how it creates perpetual animations & composes with other motion values."
  },
  {
    "title": "React: useTransform",
    "platform": "react",
    "id": "use-transform",
    "description": "Discover Motion for React's useTransform hook. Create new motion values by transforming others. Learn to map ranges & use clamp, ease, mixer for advanced control."
  },
  {
    "title": "React: useVelocity",
    "platform": "react",
    "id": "use-velocity",
    "description": "Discover Motion for React's useVelocity hook. It tracks a motion value's velocity, letting you monitor the rate of change for any animatable value easily."
  },
  {
    "title": "React: Motion for React Three Fiber",
    "platform": "react",
    "id": "three-fiber",
    "description": "Learn how to use Motion for React with React Three Fiber."
  },
  {
    "title": "React: Layout cameras",
    "platform": "react",
    "id": "three-fiber-layout-cameras",
    "description": "A perspective and orthographic camera that integrates with Framer Motion's layout animations."
  },
  {
    "title": "React: MotionCanvas",
    "platform": "react",
    "id": "three-fiber-motion-canvas",
    "description": "A React Three Fiber Canvas replacement for linking Motion for React DOM and Three.js."
  },
  {
    "title": "React: Installation guide for Motion for React",
    "platform": "react",
    "id": "installation",
    "description": "Your complete guide to installing Motion for React. Learn how to set up the animation library in any project using npm, Yarn, or pnpm, with specific guides for Next.js and Vite."
  },
  {
    "title": "React: Upgrade guide",
    "platform": "react",
    "id": "upgrade-guide",
    "description": "Stay up-to-date with Motion and Motion for React using our comprehensive Upgrade Guide. Find step-by-step instructions and details on breaking API changes for each major version, ensuring a smooth upgrade process from your current version to the latest release."
  },
  {
    "title": "React: useAnimate",
    "platform": "react",
    "id": "use-animate",
    "description": "Discover Motion for React's useAnimate hook for component-scoped animations. Use its animate function for manual control, scoped selectors & auto cleanup."
  },
  {
    "title": "React: useAnimationFrame",
    "platform": "react",
    "id": "use-animation-frame",
    "description": "Use Motion for React's useAnimationFrame hook to run callbacks on every frame. Leverage time & delta args for precise animation control & custom frame logic."
  },
  {
    "title": "React: useDragControls",
    "platform": "react",
    "id": "use-drag-controls",
    "description": "Learn how to use Motion for React's useDragControls hook to manually initiate drag gestures on motion components from any pointer event. Discover how to start dragging, enable touch support, snap to cursor, and disable automatic dragging for more custom drag interactions."
  },
  {
    "title": "React: useInView",
    "platform": "react",
    "id": "use-in-view",
    "description": "Use Motion for React's tiny useInView hook (0.6kb) to detect when elements enter the viewport. Track visibility, trigger effects & customize detection easily."
  },
  {
    "title": "React: usePageInView",
    "platform": "react",
    "id": "use-page-in-view",
    "description": "Track page visibility with Motion for React's usePageInView hook. Improve performance and UX by pausing animations when the document isn't visible. SSR-compatible and simple API."
  },
  {
    "title": "React: useReducedMotion",
    "platform": "react",
    "id": "use-reduced-motion",
    "description": "Learn to use Motion for React's useReducedMotion hook to detect reduced motion settings. Create accessible UIs by adapting animations and motion features."
  },
  {
    "title": "React: Accessibility",
    "platform": "react",
    "id": "accessibility",
    "description": "Learn how to create accessible animations with Motion for React by respecting users' 'Reduced Motion' preferences. Discover the reducedMotion option for site-wide settings and the useReducedMotion hook for custom solutions like replacing transforms with opacity, disabling autoplaying videos, and parallax effects."
  },
  {
    "title": "React: Reduce bundle size",
    "platform": "react",
    "id": "reduce-bundle-size",
    "description": "Learn how to optimize your Motion for React bundle size for faster loading web experiences. This guide explains tree shaking, the benefits of useAnimate mini (2.3kb), and how to significantly reduce the motion component's size to under 4.6kb using m and LazyMotion with lazy-loaded features."
  },
  {
    "title": "React: Motion Courses for React",
    "platform": "react",
    "id": "courses",
    "description": "Master high-performance animations. Browse Motion Certified courses for advanced theory and best practices, or explore community-led resources perfect for beginners learning Motion for React."
  },
  {
    "title": "React: Motion x Framer integration guide",
    "platform": "react",
    "id": "framer",
    "description": "Add animations to your Framer project with Motion. Use Motion in Code Components and Overrides."
  },
  {
    "title": "React: Animate your Figma projects with Motion",
    "platform": "react",
    "id": "figma",
    "description": "Animate your Figma Site with Motion. Add no-code animations with Interactions, and generate Motion code with Figma Make."
  },
  {
    "title": "React: Animating with Tailwind CSS",
    "platform": "react",
    "id": "tailwind",
    "description": "Unlock powerful UI animations by combining Motion with Tailwind CSS. This guide covers practical tricks for animating utility classes, generating CSS springs and more."
  },
  {
    "title": "React: Base UI & Motion",
    "platform": "react",
    "id": "base-ui",
    "description": "Learn how to integrate Motion with Base UI React components. This guide covers using motion components with Base UI primitives, implementing exit animations with AnimatePresence, and managing layout animations."
  },
  {
    "title": "React: Radix UI & Motion",
    "platform": "react",
    "id": "radix",
    "description": "Learn how to add smooth animations to Radix UI with Motion for React. Exit, layout, and transition examples for Tooltips, Dialogs, and more."
  },
  {
    "title": "JavaScript: Get started with Motion",
    "platform": "js",
    "id": "quick-start",
    "description": "Learn Motion animation library: Install, animate HTML/SVG/WebGL elements with spring animations, staggering effects. Complete guide with examples."
  },
  {
    "title": "JavaScript: animate",
    "platform": "js",
    "id": "animate",
    "description": "Explore Motion's powerful animate() function for creating and controlling animations. Animate HTML, SVG, CSS variables, and SVG paths with mini (2.3kb) or hybrid (18kb) versions. Utilize tween, spring, or inertia animations, build complex sequences, and take advantage of comprehensive playback controls."
  },
  {
    "title": "JavaScript: scroll",
    "platform": "js",
    "id": "scroll",
    "description": "Learn how Motion's 5.1kb scroll() function creates high-performance, scroll-linked animations by leveraging the ScrollTimeline API. Bind animations directly to scroll progress, track vertical or horizontal scroll, and target specific elements or container scroll. Discover options for scroll offsets, pinning, and detailed scroll information."
  },
  {
    "title": "JavaScript: Easing functions",
    "platform": "js",
    "id": "easing-functions",
    "description": "Explore Motion's built-in easing functions to control animation speed and feel. Learn how to use cubicBezier, steps, easeIn/Out, backIn/Out, circIn/Out, anticipate, and linear easings. Discover modifiers like reverseEasing and mirrorEasing for advanced control."
  },
  {
    "title": "JavaScript: hover",
    "platform": "js",
    "id": "hover",
    "description": "Discover Motion's hover function for reliable hover gesture detection, filtering out emulated touch events. "
  },
  {
    "title": "JavaScript: inView",
    "platform": "js",
    "id": "inview",
    "description": "Learn to use Motion's inView function to detect when elements enter and leave the viewport. Built on Intersection Observer for optimal performance (0.5kb), it's ideal for scroll-triggered animations, lazy-loading, and more. Customize detection with root, margin, and amount options."
  },
  {
    "title": "JavaScript: press",
    "platform": "js",
    "id": "press",
    "description": "Discover Motion's press function for robust press gesture detection. Learn how it filters secondary pointers, enhances accessibility with keyboard support, and simplifies event listener management. Explore options for start and end callbacks, and passive/once event handling."
  },
  {
    "title": "JavaScript: resize",
    "platform": "js",
    "id": "resize",
    "description": "Efficiently monitor and react to size changes of the viewport, or HTML and SVG elements, with resize. This function uses the ResizeObserver API to provide performant, per-element resize event handling, complete with easy-to-use cleanup. Ideal for dynamic layouts and responsive component designs."
  },
  {
    "title": "JavaScript: motionValue",
    "platform": "js",
    "id": "motion-value",
    "description": "Understand Motion Values, the core of Motion's animation system, used for tracking the state and velocity of animated properties. Learn how to manually create, set, get, and subscribe to motion values for advanced animation control and rendering with effects."
  },
  {
    "title": "JavaScript: mapValue",
    "platform": "js",
    "id": "map-value",
    "description": "Learn to use Motion's mapValue to create a new read-only motion value by mapping a numerical motion value's output to a range of numbers, colors, or complex strings. Understand how to define input/output ranges and control clamping behavior."
  },
  {
    "title": "JavaScript: transformValue",
    "platform": "js",
    "id": "transform-value",
    "description": "Discover Motion's transformValue to create new read-only motion values by computing output from one or more existing motion values. Learn how it facilitates combining multiple values or performing calculations, with automatic dependency tracking and composability."
  },
  {
    "title": "JavaScript: springValue",
    "platform": "js",
    "id": "spring-value",
    "description": "Learn to use Motion's springValue to create motion values that animate with physics-based spring motion. Discover how to apply springs to numbers or existing motion values, and configure them using options like stiffness, damping, and mass for reactive animations."
  },
  {
    "title": "JavaScript: attrEffect",
    "platform": "js",
    "id": "attr-effect",
    "description": "Discover Motion's attrEffect for applying motion values to HTML element attributes. Learn how it handles aria and data attribute casing, utilizes JavaScript setters for improved performance, and enables re-rendering when motion values update."
  },
  {
    "title": "JavaScript: propEffect",
    "platform": "js",
    "id": "prop-effect",
    "description": "Learn to use Motion's propEffect to dynamically apply motion values to JavaScript object properties. Understand how it facilitates re-rendering on updates, its utility for libraries like Three.js, and how to apply and clean up effects."
  },
  {
    "title": "JavaScript: styleEffect",
    "platform": "js",
    "id": "style-effect",
    "description": "Discover Motion's styleEffect for applying motion values to HTML elements. Learn how it supports independent transforms, default unit types, CSS properties, and enables efficient re-rendering on motion value updates."
  },
  {
    "title": "JavaScript: svgEffect",
    "platform": "js",
    "id": "svg-effect",
    "description": "Learn how to use Motion's svgEffect to apply motion values to SVG element styles and attributes. Discover how to create 'draw' animations with pathLength, pathSpacing, and pathOffset, and understand its automatic CSS-style transform origin handling."
  },
  {
    "title": "JavaScript: delay",
    "platform": "js",
    "id": "delay",
    "description": "Discover Motion's delay function, a setTimeout alternative locked to the animation frame loop. Learn how it helps synchronize callbacks with animations, and reduces computational overhead."
  },
  {
    "title": "JavaScript: frame",
    "platform": "js",
    "id": "frame",
    "description": "Learn to use Motion's frame function to schedule tasks on its optimized animation loop. Discover how it prevents layout thrashing, offers a keep-alive API for custom loops, and improves performance by avoiding multiple requestAnimationFrame calls. Understand how to schedule callbacks for read, update, and render steps."
  },
  {
    "title": "JavaScript: mix",
    "platform": "js",
    "id": "mix",
    "description": "Discover Motion's mix() function to smoothly interpolate between two values based on a 0-1 progress. Learn to mix numbers, colors (with linear RGB for better fidelity), complex strings, arrays, and objects. Explore how to apply easing and generate randomly distributed values."
  },
  {
    "title": "JavaScript: spring",
    "platform": "js",
    "id": "spring",
    "description": "Explore Motion's spring() function for creating realistic spring animations. Learn how to use it with animate() or directly for advanced scenarios like visualizers and CSS spring generation. Understand key options including keyframes, duration, bounce, damping, mass, and stiffness."
  },
  {
    "title": "JavaScript: stagger",
    "platform": "js",
    "id": "stagger",
    "description": "Learn to create staggered animations across multiple elements with Motion's stagger() function. Discover options to customize the starting delay, the stagger origin ('first', 'center', 'last', or an index), and apply easing to the stagger distribution."
  },
  {
    "title": "JavaScript: transform",
    "platform": "js",
    "id": "transform",
    "description": "Discover Motion's transform function to map an input value from one range to another. Learn how to use it with linear input ranges and various output types like numbers, colors, or complex strings."
  },
  {
    "title": "JavaScript: wrap",
    "platform": "js",
    "id": "wrap",
    "description": "Learn how to use Motion's wrap() function to constrain a value within a specific range. Ideal for implementing features like next/prev pagination by wrapping values back around when they exceed the defined minimum or maximum."
  },
  {
    "title": "JavaScript: FAQs",
    "platform": "js",
    "id": "faqs",
    "description": "Find answers to common questions about Motion, including browser support, and troubleshooting for animations."
  },
  {
    "title": "JavaScript: GSAP vs Motion: Which should you use?",
    "platform": "js",
    "id": "gsap-vs-motion",
    "description": "Compare Motion and GSAP, two leading JavaScript animation libraries. Discover Motion's advantages in bundle size, hardware acceleration via native browser APIs, and its open-source model, vs GSAP's features."
  },
  {
    "title": "JavaScript: Improvements to Web Animations API",
    "platform": "js",
    "id": "improvements-to-the-web-animations-api-dx",
    "description": "Discover how Motion enhances the Web Animations API (WAAPI) with features like spring animations, custom easings, default value types, improved animation state persistence, and independent transform animations. Learn about Motion's hybrid engine for hardware-accelerated performance."
  },
  {
    "title": "JavaScript: Migrate from GSAP to Motion",
    "platform": "js",
    "id": "migrate-from-gsap-to-motion",
    "description": "Migrate from GSAP to Motion for hardware-accelerated animations, smaller bundle sizes, and an open MIT license. Learn to convert basic animations, timelines, scroll-triggered/linked animations, and React animations to Motion."
  },
  {
    "title": "JavaScript: Animation performance",
    "platform": "js",
    "id": "performance",
    "description": "Boost web animation performance by understanding rendering and hardware acceleration. Learn which CSS properties to animate for smooth 120fps+ experiences, how to optimize rendering, and how Motion leverages hardware acceleration for jank-free animations."
  },
  {
    "title": "JavaScript: Upgrade guide",
    "platform": "js",
    "id": "upgrade-guide",
    "description": "Upgrade to the latest version of Motion by following our incremental, version-by-version guide. Major version changes are typically small, making for a quick process."
  },
  {
    "title": "JavaScript: glide",
    "platform": "js",
    "id": "glide",
    "description": "The glide easing can create momentum scroll effects and more."
  },
  {
    "title": "JavaScript: CSS",
    "platform": "js",
    "id": "css",
    "description": "Learn how to create spring animations with CSS using Motion, both server-side and in the browser. This guide covers React Server Components, CSS-in-JS, Astro, Vue, and provides cross-browser fallback solutions."
  },
  {
    "title": "JavaScript: Add animations to your Squarespace site",
    "platform": "js",
    "id": "squarespace",
    "description": "Elevate your Squarespace site with Motion: a free, high-performance animation library. Break free from template limits, create stunning animations, and boost your SEO with its incredibly small footprint. Easy to install and customize for optimal site speed and search ranking."
  },
  {
    "title": "JavaScript: Add animations to your WordPress site",
    "platform": "js",
    "id": "wordpress",
    "description": "Enhance your WordPress site with Motion: a free, open-source animation library for creating stunning, high-performance animations. Its tiny footprint and flexibility boost your site's speed and SEO rankings, offering limitless creative possibilities."
  }
]